Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
#include "esp32_p4_vad_feedback.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_websocket_client.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "cJSON.h"
#include "mbedtls/base64.h"
#include <string.h>

static const char *TAG = "VAD_Feedback";

// Forward declarations for internal functions
static esp_err_t decode_base64_audio_optimized(const char *base64_data, uint8_t **audio_data, size_t *audio_len, uint8_t *pool_index);

// JSON message templates
#define JSON_WAKE_WORD_TEMPLATE \
    "{\"type\":\"wake_word_detection\"," \
    "\"detection_id\":%lu," \
    "\"device_id\":\"%s\"," \
    "\"timestamp\":%llu," \
    "\"confidence\":%.3f," \
    "\"energy_level\":%d," \
    "\"pattern_score\":%d," \
    "\"syllable_count\":%d," \
    "\"duration_ms\":%d," \
    "\"vad_active\":%s," \
    "\"snr_db\":%.1f}"

#define JSON_STATISTICS_TEMPLATE \
    "{\"type\":\"device_statistics\"," \
    "\"device_id\":\"%s\"," \
    "\"timestamp\":%llu," \
    "\"wake_word_stats\":{" \
        "\"total_detections\":%lu," \
        "\"true_positives\":%lu," \
        "\"false_positives\":%lu," \
        "\"avg_confidence\":%.3f," \
        "\"current_threshold\":%d" \
    "}," \
    "\"vad_stats\":{" \
        "\"voice_packets\":%lu," \
        "\"silence_packets\":%lu," \
        "\"avg_confidence\":%.3f" \
    "}}"

#define JSON_PING_TEMPLATE \
    "{\"type\":\"ping\"," \
    "\"device_id\":\"%s\"," \
    "\"timestamp\":%llu}"

/**
 * @brief Internal VAD feedback client structure
 */
typedef struct vad_feedback_client {
    // Configuration
    vad_feedback_config_t config;
    
    // WebSocket client
    esp_websocket_client_handle_t ws_client;
    bool connected;
    uint32_t connection_start_time;
    
    // Event handling
    vad_feedback_event_callback_t event_callback;
    void *callback_user_data;
    
    // Message queue for sending
    QueueHandle_t send_queue;
    TaskHandle_t send_task;
    
    // Statistics
    vad_feedback_stats_t stats;
    
    // Pending validations (for tracking feedback timing)
    struct {
        uint32_t detection_id;
        uint32_t timestamp_ms;
    } pending_validations[10];
    uint8_t pending_count;
    
    // Thread safety
    SemaphoreHandle_t mutex;
    
    // State
    bool initialized;
    bool training_mode;
    
    // TTS audio session management
    vad_feedback_tts_session_t current_tts_session;
    bool tts_session_active;
    vad_feedback_tts_audio_callback_t tts_callback;
    void *tts_callback_user_data;
    
    // TTS audio buffering
    QueueHandle_t tts_audio_queue;
    TaskHandle_t tts_processing_task;
    uint16_t tts_chunks_received;
    uint16_t tts_chunks_played;
    uint32_t tts_audio_buffer_size;
    
} vad_feedback_client_t;

// Message queue item
typedef struct {
    char *json_data;
    size_t json_len;
} vad_feedback_message_t;

// Performance optimized TTS audio queue item with pre-allocated buffers
#define TTS_AUDIO_CHUNK_POOL_SIZE 8
#define MAX_TTS_CHUNK_SIZE 1024  // Max audio chunk size in bytes

// Pre-allocated audio chunk pool for zero-malloc audio processing
static struct {
    uint8_t buffer[MAX_TTS_CHUNK_SIZE];
    bool in_use;
} s_tts_chunk_pool[TTS_AUDIO_CHUNK_POOL_SIZE] = {0};

// TTS audio queue item (optimized for performance)
typedef struct {
    vad_feedback_tts_chunk_t chunk_data;
    bool session_start;
    bool session_end;
    uint8_t pool_index;  // Index in pre-allocated pool (0xFF if not using pool)
    vad_feedback_tts_session_t session_info;  // Only valid if session_start is true
    vad_feedback_tts_end_t end_info;          // Only valid if session_end is true
} tts_audio_queue_item_t;

// Forward declarations
static void websocket_event_handler(void *handler_args, esp_event_base_t base, 
                                   int32_t event_id, void *event_data);
static void send_task(void *pvParameters);
static esp_err_t queue_json_message(vad_feedback_client_t *client, const char *json_data);
static void process_server_message(vad_feedback_client_t *client, const char *message);
static void add_pending_validation(vad_feedback_client_t *client, uint32_t detection_id);
static bool remove_pending_validation(vad_feedback_client_t *client, uint32_t detection_id, 
                                     uint32_t *elapsed_ms);

// TTS audio processing functions
static void tts_processing_task(void *pvParameters);
static esp_err_t parse_tts_audio_start(const cJSON *json, vad_feedback_tts_session_t *session);
static esp_err_t parse_tts_audio_chunk(const cJSON *json, vad_feedback_tts_chunk_t *chunk);
static esp_err_t parse_tts_audio_end(const cJSON *json, vad_feedback_tts_end_t *end_info);
static esp_err_t decode_base64_audio(const char *base64_data, uint8_t **audio_data, size_t *audio_len);
static esp_err_t queue_tts_audio_item(vad_feedback_client_t *client, const tts_audio_queue_item_t *item);
static void cleanup_tts_session(vad_feedback_client_t *client);

vad_feedback_handle_t vad_feedback_init(const vad_feedback_config_t *config,
                                       vad_feedback_event_callback_t event_callback,
                                       void *user_data)
{
    if (!config || !event_callback) {
        ESP_LOGE(TAG, "Invalid configuration or callback");
        return NULL;
    }
    
    vad_feedback_client_t *client = malloc(sizeof(vad_feedback_client_t));
    if (!client) {
        ESP_LOGE(TAG, "Failed to allocate memory for VAD feedback client");
        return NULL;
    }
    
    memset(client, 0, sizeof(vad_feedback_client_t));
    
    // Copy configuration
    client->config = *config;
    client->event_callback = event_callback;
    client->callback_user_data = user_data;
    
    // Create mutex
    client->mutex = xSemaphoreCreateMutex();
    if (!client->mutex) {
        ESP_LOGE(TAG, "Failed to create mutex");
        free(client);
        return NULL;
    }
    
    // Create message queue
    client->send_queue = xQueueCreate(config->message_queue_size, sizeof(vad_feedback_message_t));
    if (!client->send_queue) {
        ESP_LOGE(TAG, "Failed to create message queue");
        vSemaphoreDelete(client->mutex);
        free(client);
        return NULL;
    }
    
    // Configure WebSocket client
    esp_websocket_client_config_t ws_config = {
        .uri = config->server_uri,
        .buffer_size = config->buffer_size,
        .reconnect_timeout_ms = config->reconnect_interval_ms,
        .network_timeout_ms = config->connection_timeout_ms,
        .disable_auto_reconnect = !config->auto_reconnect,
        .keep_alive_idle = config->keepalive_interval_ms / 1000,
        .keep_alive_interval = 5,
        .keep_alive_count = 3,
        .task_stack = 6144,  // Increased stack size for JSON processing
    };
    
