Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
    client->ws_client = esp_websocket_client_init(&ws_config);
    if (!client->ws_client) {
        ESP_LOGE(TAG, "Failed to initialize WebSocket client");
        vQueueDelete(client->send_queue);
        vSemaphoreDelete(client->mutex);
        free(client);
        return NULL;
    }
    
    // Register WebSocket event handler
    esp_websocket_register_events(client->ws_client, WEBSOCKET_EVENT_ANY, 
                                  websocket_event_handler, client);
    
    // Create send task
    BaseType_t task_ret = xTaskCreatePinnedToCore(
        send_task,
        "vad_feedback_send",
        4096,
        client,
        5,  // Medium priority
        &client->send_task,
        0   // Core 0 (network core)
    );
    
    if (task_ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create send task");
        esp_websocket_client_destroy(client->ws_client);
        vQueueDelete(client->send_queue);
        vSemaphoreDelete(client->mutex);
        free(client);
        return NULL;
    }
    
    // Create TTS audio queue for streaming audio chunks
    client->tts_audio_queue = xQueueCreate(20, sizeof(tts_audio_queue_item_t));
    if (!client->tts_audio_queue) {
        ESP_LOGE(TAG, "Failed to create TTS audio queue");
        vTaskDelete(client->send_task);
        esp_websocket_client_destroy(client->ws_client);
        vQueueDelete(client->send_queue);
        vSemaphoreDelete(client->mutex);
        free(client);
        return NULL;
    }
    
    // Create TTS processing task
    task_ret = xTaskCreatePinnedToCore(
        tts_processing_task,
        "vad_tts_process",
        8192,  // Large stack for audio processing
        client,
        6,     // Higher priority than send task
        &client->tts_processing_task,
        1      // Core 1 (audio processing core)
    );
    
    if (task_ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create TTS processing task");
        vQueueDelete(client->tts_audio_queue);
        vTaskDelete(client->send_task);
        esp_websocket_client_destroy(client->ws_client);
        vQueueDelete(client->send_queue);
        vSemaphoreDelete(client->mutex);
        free(client);
        return NULL;
    }
    
    // Initialize TTS session state
    client->tts_session_active = false;
    client->tts_chunks_received = 0;
    client->tts_chunks_played = 0;
    client->tts_callback = NULL;
    client->tts_callback_user_data = NULL;
    
    client->initialized = true;
    
    ESP_LOGI(TAG, "VAD feedback client initialized");
    ESP_LOGI(TAG, "Server URI: %s", config->server_uri);
    ESP_LOGI(TAG, "Device: %s (%s)", config->device_name, config->device_id);
    ESP_LOGI(TAG, "Wake word feedback: %s", config->enable_wake_word_feedback ? "enabled" : "disabled");
    ESP_LOGI(TAG, "Threshold adaptation: %s", config->enable_threshold_adaptation ? "enabled" : "disabled");
    
    return (vad_feedback_handle_t)client;
}

esp_err_t vad_feedback_deinit(vad_feedback_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->initialized) {
        return ESP_ERR_INVALID_STATE;
    }
    
    // Stop WebSocket connection
    if (client->connected) {
        vad_feedback_disconnect(handle);
    }
    
    // Delete send task
    if (client->send_task) {
        vTaskDelete(client->send_task);
    }
    
    // Delete TTS processing task
    if (client->tts_processing_task) {
        vTaskDelete(client->tts_processing_task);
    }
    
    // Clean up TTS session if active
    if (client->tts_session_active) {
        cleanup_tts_session(client);
    }
    
    // Clean up TTS audio queue
    if (client->tts_audio_queue) {
        tts_audio_queue_item_t tts_item;
        while (xQueueReceive(client->tts_audio_queue, &tts_item, 0) == pdTRUE) {
            // Free audio data if allocated
            if (tts_item.chunk_data.audio_data) {
                free(tts_item.chunk_data.audio_data);
            }
        }
        vQueueDelete(client->tts_audio_queue);
    }
    
    // Clean up message queue
    vad_feedback_message_t msg;
    while (xQueueReceive(client->send_queue, &msg, 0) == pdTRUE) {
        free(msg.json_data);
    }
    vQueueDelete(client->send_queue);
    
    // Destroy WebSocket client
    if (client->ws_client) {
        esp_websocket_client_destroy(client->ws_client);
    }
    
    // Delete mutex
    vSemaphoreDelete(client->mutex);
    
    free(client);
    
    ESP_LOGI(TAG, "VAD feedback client deinitialized");
    return ESP_OK;
}

esp_err_t vad_feedback_connect(vad_feedback_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->initialized) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (client->connected) {
        ESP_LOGW(TAG, "VAD feedback client already connected");
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Connecting VAD feedback WebSocket to %s", client->config.server_uri);
    
    esp_err_t ret = esp_websocket_client_start(client->ws_client);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start WebSocket client: %s", esp_err_to_name(ret));
        return ret;
    }
    
    return ESP_OK;
}

esp_err_t vad_feedback_disconnect(vad_feedback_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->connected) {
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Disconnecting VAD feedback WebSocket");
    
    esp_err_t ret = esp_websocket_client_stop(client->ws_client);
    client->connected = false;
    
    return ret;
}

esp_err_t vad_feedback_send_wake_word_detection(vad_feedback_handle_t handle,
                                              uint32_t detection_id,
                                              const esp32_p4_wake_word_result_t *wake_word_result,
                                              const enhanced_vad_result_t *vad_result)
{
    if (!handle || !wake_word_result) {
        return ESP_ERR_INVALID_ARG;
    }
    
