Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->connected || !client->config.enable_wake_word_feedback) {
        return ESP_ERR_INVALID_STATE;
    }
    
    uint64_t timestamp = esp_timer_get_time() / 1000; // Convert to milliseconds
    
    // Build JSON message
    char json_buffer[1024];
    int json_len = snprintf(json_buffer, sizeof(json_buffer), JSON_WAKE_WORD_TEMPLATE,
        detection_id,
        client->config.device_id,
        timestamp,
        wake_word_result->confidence_score,
        wake_word_result->energy_level,
        wake_word_result->pattern_match_score,
        wake_word_result->syllable_count,
        wake_word_result->detection_duration_ms,
        wake_word_result->vad_active ? "true" : "false",
        vad_result ? vad_result->snr_db : 0.0f
    );
    
    if (json_len < 0 || json_len >= sizeof(json_buffer)) {
        ESP_LOGE(TAG, "Failed to format wake word JSON message");
        return ESP_FAIL;
    }
    
    // Add to pending validations for timing tracking
    add_pending_validation(client, detection_id);
    
    esp_err_t ret = queue_json_message(client, json_buffer);
    if (ret == ESP_OK) {
        client->stats.messages_sent++;
        client->stats.bytes_transmitted += json_len;
        ESP_LOGD(TAG, "Queued wake word detection for validation (ID: %lu)", detection_id);
    }
    
    return ret;
}

esp_err_t vad_feedback_send_statistics(vad_feedback_handle_t handle,
                                      const esp32_p4_wake_word_stats_t *wake_word_stats,
                                      const enhanced_udp_audio_stats_t *vad_stats)
{
    if (!handle || !wake_word_stats) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->connected) {
        return ESP_ERR_INVALID_STATE;
    }
    
    uint64_t timestamp = esp_timer_get_time() / 1000;
    
    // Build JSON statistics message
    char json_buffer[1536];
    int json_len = snprintf(json_buffer, sizeof(json_buffer), JSON_STATISTICS_TEMPLATE,
        client->config.device_id,
        timestamp,
        wake_word_stats->total_detections,
        wake_word_stats->true_positives,
        wake_word_stats->false_positives,
        wake_word_stats->average_confidence,
        wake_word_stats->current_energy_threshold,
        vad_stats ? vad_stats->voice_packets_sent : 0,
        vad_stats ? vad_stats->silence_packets_sent : 0,
        vad_stats ? vad_stats->average_vad_confidence : 0.0f
    );
    
    if (json_len < 0 || json_len >= sizeof(json_buffer)) {
        ESP_LOGE(TAG, "Failed to format statistics JSON message");
        return ESP_FAIL;
    }
    
    esp_err_t ret = queue_json_message(client, json_buffer);
    if (ret == ESP_OK) {
        client->stats.messages_sent++;
        client->stats.bytes_transmitted += json_len;
        ESP_LOGD(TAG, "Sent device statistics to server");
    }
    
    return ret;
}

esp_err_t vad_feedback_ping(vad_feedback_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->connected) {
        return ESP_ERR_INVALID_STATE;
    }
    
    uint64_t timestamp = esp_timer_get_time() / 1000;
    
    char json_buffer[256];
    int json_len = snprintf(json_buffer, sizeof(json_buffer), JSON_PING_TEMPLATE,
        client->config.device_id,
        timestamp
    );
    
    if (json_len < 0 || json_len >= sizeof(json_buffer)) {
        ESP_LOGE(TAG, "Failed to format ping JSON message");
        return ESP_FAIL;
    }
    
    esp_err_t ret = queue_json_message(client, json_buffer);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Sent ping to VAD feedback server");
    }
    
    return ret;
}

bool vad_feedback_is_connected(vad_feedback_handle_t handle)
{
    if (!handle) {
        return false;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    return client->connected;
}

esp_err_t vad_feedback_get_stats(vad_feedback_handle_t handle, vad_feedback_stats_t *stats)
{
    if (!handle || !stats) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        *stats = client->stats;
        
        // Calculate connection uptime
        if (client->connected && client->connection_start_time > 0) {
            stats->connection_uptime_s = (esp_timer_get_time() / 1000000) - client->connection_start_time;
        }
        
        // Calculate validation accuracy
        uint32_t total_validations = stats->positive_validations + stats->negative_validations;
        if (total_validations > 0) {
            stats->validation_accuracy = (float)stats->positive_validations / total_validations;
        }
        
        xSemaphoreGive(client->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t vad_feedback_get_default_config(const char *server_ip,
                                         const char *device_id,
                                         vad_feedback_config_t *config)
{
    if (!server_ip || !device_id || !config) {
        return ESP_ERR_INVALID_ARG;
    }
    
    memset(config, 0, sizeof(vad_feedback_config_t));
    
    // Build WebSocket URI
    snprintf(config->server_uri, sizeof(config->server_uri), 
             "ws://%s:8002/vad_feedback", server_ip);
    config->server_port = 8002;
    config->connection_timeout_ms = 5000;
    
    // Device identification
    strncpy(config->device_id, device_id, sizeof(config->device_id) - 1);
    strncpy(config->device_name, "HowdyScreen", sizeof(config->device_name) - 1);
    strncpy(config->room, "unknown", sizeof(config->room) - 1);
    
    // Feedback settings
    config->enable_wake_word_feedback = true;
    config->enable_threshold_adaptation = true;
    config->enable_training_mode = false;
    config->feedback_timeout_ms = 3000;
    
    // Connection management
    config->auto_reconnect = true;
    config->reconnect_interval_ms = 10000;
    config->max_reconnect_attempts = 5;
    
    // Performance settings
    config->keepalive_interval_ms = 30000;
    config->message_queue_size = 20;
    config->buffer_size = 2048;
    
    return ESP_OK;
}

// WebSocket event handler
static void websocket_event_handler(void *handler_args, esp_event_base_t base, 
                                   int32_t event_id, void *event_data)
{
    vad_feedback_client_t *client = (vad_feedback_client_t*)handler_args;
    esp_websocket_event_data_t *data = (esp_websocket_event_data_t*)event_data;
    
    switch (event_id) {
        case WEBSOCKET_EVENT_CONNECTED:
            ESP_LOGI(TAG, "VAD feedback WebSocket connected");
            client->connected = true;
            client->connection_start_time = esp_timer_get_time() / 1000000;
            client->stats.reconnections++;
            break;
            
        case WEBSOCKET_EVENT_DISCONNECTED:
            ESP_LOGI(TAG, "VAD feedback WebSocket disconnected");
            client->connected = false;
            break;
            
        case WEBSOCKET_EVENT_DATA:
            if (data->op_code == 0x01) { // Text frame
                char *message = malloc(data->data_len + 1);
                if (message) {
                    memcpy(message, data->data_ptr, data->data_len);
                    message[data->data_len] = '\0';
                    
                    client->stats.messages_received++;
                    client->stats.bytes_received += data->data_len;
                    
                    ESP_LOGD(TAG, "Received VAD feedback message: %s", message);
                    process_server_message(client, message);
                    
                    free(message);
                }
            }
            break;
            
        case WEBSOCKET_EVENT_ERROR:
            ESP_LOGE(TAG, "VAD feedback WebSocket error");
            client->connected = false;
            break;
            
        default:
            break;
    }
}

// Send task implementation
static void send_task(void *pvParameters)
{
    vad_feedback_client_t *client = (vad_feedback_client_t*)pvParameters;
    vad_feedback_message_t msg;
    
    ESP_LOGI(TAG, "VAD feedback send task started");
    
    while (1) {
        // Wait for messages in queue
        if (xQueueReceive(client->send_queue, &msg, pdMS_TO_TICKS(1000)) == pdTRUE) {
            
            if (client->connected && msg.json_data) {
                int sent = esp_websocket_client_send_text(client->ws_client, msg.json_data, 
                                                         strlen(msg.json_data), pdMS_TO_TICKS(1000));
                if (sent > 0) {
                    ESP_LOGV(TAG, "Sent JSON message: %s", msg.json_data);
                } else {
                    ESP_LOGW(TAG, "Failed to send JSON message");
                }
            }
            
            // Free message data
            if (msg.json_data) {
                free(msg.json_data);
            }
        }
        
