Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
        // Periodic keepalive ping
        static uint64_t last_ping = 0;
        uint64_t now = esp_timer_get_time() / 1000;
        
        if (client->connected && (now - last_ping) > client->config.keepalive_interval_ms) {
            vad_feedback_ping((vad_feedback_handle_t)client);
            last_ping = now;
        }
    }
    
    ESP_LOGI(TAG, "VAD feedback send task ended");
    vTaskDelete(NULL);
}

// Helper function implementations
static esp_err_t queue_json_message(vad_feedback_client_t *client, const char *json_data)
{
    if (!json_data) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_message_t msg;
    msg.json_len = strlen(json_data);
    msg.json_data = malloc(msg.json_len + 1);
    
    if (!msg.json_data) {
        ESP_LOGE(TAG, "Failed to allocate memory for JSON message");
        return ESP_ERR_NO_MEM;
    }
    
    strcpy(msg.json_data, json_data);
    
    if (xQueueSend(client->send_queue, &msg, pdMS_TO_TICKS(100)) != pdTRUE) {
        ESP_LOGW(TAG, "Failed to queue JSON message - queue full");
        free(msg.json_data);
        return ESP_ERR_TIMEOUT;
    }
    
    return ESP_OK;
}

static void process_server_message(vad_feedback_client_t *client, const char *message)
{
    cJSON *json = cJSON_Parse(message);
    if (!json) {
        ESP_LOGE(TAG, "Failed to parse JSON message from server");
        return;
    }
    
    cJSON *type_obj = cJSON_GetObjectItem(json, "type");
    if (!cJSON_IsString(type_obj)) {
        ESP_LOGE(TAG, "Invalid message type in server message");
        cJSON_Delete(json);
        return;
    }
    
    const char *type = cJSON_GetStringValue(type_obj);
    
    if (strcmp(type, "wake_word_validation") == 0) {
        // Handle wake word validation response
        cJSON *detection_id_obj = cJSON_GetObjectItem(json, "detection_id");
        cJSON *validated_obj = cJSON_GetObjectItem(json, "validated");
        cJSON *confidence_obj = cJSON_GetObjectItem(json, "confidence");
        
        if (cJSON_IsNumber(detection_id_obj) && cJSON_IsBool(validated_obj)) {
            uint32_t detection_id = (uint32_t)cJSON_GetNumberValue(detection_id_obj);
            bool validated = cJSON_IsTrue(validated_obj);
            float server_confidence = cJSON_IsNumber(confidence_obj) ? 
                (float)cJSON_GetNumberValue(confidence_obj) : 0.0f;
            
            // Find and remove from pending validations
            uint32_t elapsed_ms = 0;
            bool found = remove_pending_validation(client, detection_id, &elapsed_ms);
            
            if (found) {
                client->stats.average_feedback_time_ms = 
                    (client->stats.average_feedback_time_ms * client->stats.wake_word_validations + 
                     elapsed_ms) / (client->stats.wake_word_validations + 1);
            }
            
            // Update statistics
            client->stats.wake_word_validations++;
            if (validated) {
                client->stats.positive_validations++;
            } else {
                client->stats.negative_validations++;
            }
            
            // Create validation structure
            vad_feedback_wake_word_validation_t validation = {
                .detection_id = detection_id,
                .validated = validated,
                .server_confidence = server_confidence,
                .processing_time_ms = elapsed_ms
            };
            
            // Call event callback
            if (client->event_callback) {
                client->event_callback(VAD_FEEDBACK_WAKE_WORD_VALIDATION, 
                                     &validation, sizeof(validation), 
                                     client->callback_user_data);
            }
            
            ESP_LOGI(TAG, "%s Server %s wake word detection (ID: %lu, confidence: %.3f, time: %lums)", 
                    validated ? "✅" : "❌",
                    validated ? "validated" : "rejected", 
                    detection_id, server_confidence, elapsed_ms);
        }
    } else if (strcmp(type, "threshold_update") == 0) {
        // Handle threshold update recommendation
        cJSON *energy_threshold_obj = cJSON_GetObjectItem(json, "energy_threshold");
        cJSON *confidence_threshold_obj = cJSON_GetObjectItem(json, "confidence_threshold");
        
        if (cJSON_IsNumber(energy_threshold_obj) && cJSON_IsNumber(confidence_threshold_obj)) {
            vad_feedback_threshold_update_t threshold_update = {
                .new_energy_threshold = (uint16_t)cJSON_GetNumberValue(energy_threshold_obj),
                .new_confidence_threshold = (float)cJSON_GetNumberValue(confidence_threshold_obj),
                .urgency = 128  // Default medium urgency
            };
            
            // Get optional fields
            cJSON *reason_obj = cJSON_GetObjectItem(json, "reason");
            if (cJSON_IsString(reason_obj)) {
                strncpy(threshold_update.reason, cJSON_GetStringValue(reason_obj), 
                       sizeof(threshold_update.reason) - 1);
            }
            
            // Call event callback
            if (client->event_callback && client->config.enable_threshold_adaptation) {
                client->event_callback(VAD_FEEDBACK_THRESHOLD_UPDATE, 
                                     &threshold_update, sizeof(threshold_update), 
                                     client->callback_user_data);
            }
            
            client->stats.threshold_updates++;
            ESP_LOGI(TAG, "🔧 Received threshold update: energy=%d, confidence=%.3f", 
                    threshold_update.new_energy_threshold, 
                    threshold_update.new_confidence_threshold);
        }
    } else if (strcmp(type, "pong") == 0) {
        ESP_LOGD(TAG, "Received pong from VAD feedback server");
    } else if (strcmp(type, "tts_audio_start") == 0) {
        // Handle TTS audio session start
        vad_feedback_tts_session_t session;
        esp_err_t ret = parse_tts_audio_start(json, &session);
        if (ret == ESP_OK) {
            tts_audio_queue_item_t item = {
                .session_start = true,
                .session_end = false,
                .session_info = session
            };
            queue_tts_audio_item(client, &item);
            ESP_LOGI(TAG, "🎵 TTS session started: %s (duration: %dms)", 
                    session.session_id, session.estimated_duration_ms);
        }
    } else if (strcmp(type, "tts_audio_chunk") == 0) {
        // Handle TTS audio chunk
        vad_feedback_tts_chunk_t chunk;
        esp_err_t ret = parse_tts_audio_chunk(json, &chunk);
        if (ret == ESP_OK) {
            tts_audio_queue_item_t item = {
                .session_start = false,
                .session_end = false,
                .chunk_data = chunk
            };
            queue_tts_audio_item(client, &item);
            ESP_LOGV(TAG, "🎵 TTS chunk %d received (%d bytes)", 
                    chunk.chunk_sequence, chunk.chunk_size);
        }
    } else if (strcmp(type, "tts_audio_end") == 0) {
        // Handle TTS audio session end
        vad_feedback_tts_end_t end_info;
        esp_err_t ret = parse_tts_audio_end(json, &end_info);
        if (ret == ESP_OK) {
            tts_audio_queue_item_t item = {
                .session_start = false,
                .session_end = true,
                .end_info = end_info
            };
            queue_tts_audio_item(client, &item);
            ESP_LOGI(TAG, "🎵 TTS session ended: %s (%d chunks, %d bytes)", 
                    end_info.session_id, end_info.total_chunks_sent, end_info.total_audio_bytes);
        }
    } else {
        ESP_LOGD(TAG, "Received unknown message type: %s", type);
    }
    
    cJSON_Delete(json);
}

static void add_pending_validation(vad_feedback_client_t *client, uint32_t detection_id)
{
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        if (client->pending_count < 10) {
            client->pending_validations[client->pending_count].detection_id = detection_id;
            client->pending_validations[client->pending_count].timestamp_ms = esp_timer_get_time() / 1000;
            client->pending_count++;
        }
        xSemaphoreGive(client->mutex);
    }
}

static bool remove_pending_validation(vad_feedback_client_t *client, uint32_t detection_id, 
                                     uint32_t *elapsed_ms)
{
    bool found = false;
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        for (uint8_t i = 0; i < client->pending_count; i++) {
            if (client->pending_validations[i].detection_id == detection_id) {
                if (elapsed_ms) {
                    *elapsed_ms = (esp_timer_get_time() / 1000) - 
                                 client->pending_validations[i].timestamp_ms;
                }
                
                // Remove from array by shifting
                for (uint8_t j = i; j < client->pending_count - 1; j++) {
                    client->pending_validations[j] = client->pending_validations[j + 1];
                }
                client->pending_count--;
                found = true;
                break;
            }
        }
        xSemaphoreGive(client->mutex);
    }
    
    return found;
}

// TTS processing task implementation
static void tts_processing_task(void *pvParameters)
{
    vad_feedback_client_t *client = (vad_feedback_client_t*)pvParameters;
    tts_audio_queue_item_t item;
    
