Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
    ESP_LOGI(TAG, "TTS processing task started");
    
    while (1) {
        // Wait for TTS audio items in queue
        if (xQueueReceive(client->tts_audio_queue, &item, pdMS_TO_TICKS(1000)) == pdTRUE) {
            
            if (item.session_start) {
                // Handle TTS session start
                ESP_LOGI(TAG, "🎵 Starting TTS session: %s", item.session_info.session_id);
                
                if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                    client->current_tts_session = item.session_info;
                    client->tts_session_active = true;
                    client->tts_chunks_received = 0;
                    client->tts_chunks_played = 0;
                    xSemaphoreGive(client->mutex);
                }
                
                // Notify application via event callback
                if (client->event_callback) {
                    client->event_callback(VAD_FEEDBACK_TTS_AUDIO_START, 
                                         &item.session_info, sizeof(item.session_info), 
                                         client->callback_user_data);
                }
                
            } else if (item.session_end) {
                // Handle TTS session end
                ESP_LOGI(TAG, "🎵 Ending TTS session: %s", item.end_info.session_id);
                
                // Notify application via event callback
                if (client->event_callback) {
                    client->event_callback(VAD_FEEDBACK_TTS_AUDIO_END, 
                                         &item.end_info, sizeof(item.end_info), 
                                         client->callback_user_data);
                }
                
                // Cleanup session
                cleanup_tts_session(client);
                
            } else {
                // Handle TTS audio chunk
                if (client->tts_session_active && 
                    strcmp(item.chunk_data.session_id, client->current_tts_session.session_id) == 0) {
                    
                    ESP_LOGV(TAG, "🎵 Processing TTS chunk %d (%d bytes)", 
                            item.chunk_data.chunk_sequence, item.chunk_data.chunk_size);
                    
                    client->tts_chunks_received++;
                    
                    // Call TTS audio callback if registered
                    if (client->tts_callback && item.chunk_data.audio_data) {
                        client->tts_callback(&client->current_tts_session,
                                           (const int16_t*)item.chunk_data.audio_data,
                                           item.chunk_data.chunk_size / 2,  // Convert bytes to samples
                                           client->tts_callback_user_data);
                        
                        client->tts_chunks_played++;
                    }
                    
                    // Notify application via event callback
                    if (client->event_callback) {
                        client->event_callback(VAD_FEEDBACK_TTS_AUDIO_CHUNK, 
                                             &item.chunk_data, sizeof(item.chunk_data), 
                                             client->callback_user_data);
                    }
                }
                
                // Performance optimized cleanup: use pool or free as appropriate
                if (item.chunk_data.audio_data) {
                    if (item.pool_index != 0xFF && item.pool_index < TTS_AUDIO_CHUNK_POOL_SIZE) {
                        // Return buffer to pool
                        s_tts_chunk_pool[item.pool_index].in_use = false;
                        ESP_LOGV(TAG, "Returned TTS chunk to pool (index: %d)", item.pool_index);
                    } else {
                        // Free malloc'd buffer
                        free(item.chunk_data.audio_data);
                        ESP_LOGV(TAG, "Freed malloc'd TTS chunk buffer");
                    }
                }
            }
        }
    }
    
    ESP_LOGI(TAG, "TTS processing task ended");
    vTaskDelete(NULL);
}

// Parse TTS audio start message
static esp_err_t parse_tts_audio_start(const cJSON *json, vad_feedback_tts_session_t *session)
{
    if (!json || !session) {
        return ESP_ERR_INVALID_ARG;
    }
    
    memset(session, 0, sizeof(vad_feedback_tts_session_t));
    
    // Parse session info
    cJSON *session_info = cJSON_GetObjectItem(json, "session_info");
    if (!session_info) {
        ESP_LOGE(TAG, "Missing session_info in TTS audio start");
        return ESP_FAIL;
    }
    
    cJSON *session_id = cJSON_GetObjectItem(session_info, "session_id");
    if (cJSON_IsString(session_id)) {
        strncpy(session->session_id, cJSON_GetStringValue(session_id), sizeof(session->session_id) - 1);
    } else {
        ESP_LOGE(TAG, "Missing session_id in TTS audio start");
        return ESP_FAIL;
    }
    
    cJSON *response_text = cJSON_GetObjectItem(session_info, "response_text");
    if (cJSON_IsString(response_text)) {
        strncpy(session->response_text, cJSON_GetStringValue(response_text), sizeof(session->response_text) - 1);
    }
    
    cJSON *estimated_duration = cJSON_GetObjectItem(session_info, "estimated_duration_ms");
    if (cJSON_IsNumber(estimated_duration)) {
        session->estimated_duration_ms = (uint16_t)cJSON_GetNumberValue(estimated_duration);
    }
    
    cJSON *total_chunks = cJSON_GetObjectItem(session_info, "total_chunks_expected");
    if (cJSON_IsNumber(total_chunks)) {
        session->total_chunks_expected = (uint16_t)cJSON_GetNumberValue(total_chunks);
    }
    
    // Parse audio format
    cJSON *audio_format = cJSON_GetObjectItem(json, "audio_format");
    if (audio_format) {
        cJSON *sample_rate = cJSON_GetObjectItem(audio_format, "sample_rate");
        if (cJSON_IsNumber(sample_rate)) {
            session->sample_rate = (uint32_t)cJSON_GetNumberValue(sample_rate);
        } else {
            session->sample_rate = 16000;  // Default
        }
        
