Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
        cJSON *channels = cJSON_GetObjectItem(audio_format, "channels");
        if (cJSON_IsNumber(channels)) {
            session->channels = (uint8_t)cJSON_GetNumberValue(channels);
        } else {
            session->channels = 1;  // Default mono
        }
        
        cJSON *bits_per_sample = cJSON_GetObjectItem(audio_format, "bits_per_sample");
        if (cJSON_IsNumber(bits_per_sample)) {
            session->bits_per_sample = (uint8_t)cJSON_GetNumberValue(bits_per_sample);
        } else {
            session->bits_per_sample = 16;  // Default 16-bit
        }
        
        cJSON *total_samples = cJSON_GetObjectItem(audio_format, "total_samples");
        if (cJSON_IsNumber(total_samples)) {
            session->total_samples = (uint32_t)cJSON_GetNumberValue(total_samples);
        }
    }
    
    // Parse playback config
    cJSON *playback_config = cJSON_GetObjectItem(json, "playback_config");
    if (playback_config) {
        cJSON *volume = cJSON_GetObjectItem(playback_config, "volume");
        if (cJSON_IsNumber(volume)) {
            session->volume = (float)cJSON_GetNumberValue(volume);
        } else {
            session->volume = 0.8f;  // Default volume
        }
        
        cJSON *fade_in = cJSON_GetObjectItem(playback_config, "fade_in_ms");
        if (cJSON_IsNumber(fade_in)) {
            session->fade_in_ms = (uint16_t)cJSON_GetNumberValue(fade_in);
        }
        
        cJSON *fade_out = cJSON_GetObjectItem(playback_config, "fade_out_ms");
        if (cJSON_IsNumber(fade_out)) {
            session->fade_out_ms = (uint16_t)cJSON_GetNumberValue(fade_out);
        }
        
        cJSON *interrupt_recording = cJSON_GetObjectItem(playback_config, "interrupt_recording");
        if (cJSON_IsBool(interrupt_recording)) {
            session->interrupt_recording = cJSON_IsTrue(interrupt_recording);
        } else {
            session->interrupt_recording = true;  // Default interrupt recording
        }
        
        cJSON *echo_cancellation = cJSON_GetObjectItem(playback_config, "echo_cancellation");
        if (cJSON_IsBool(echo_cancellation)) {
            session->echo_cancellation = cJSON_IsTrue(echo_cancellation);
        } else {
            session->echo_cancellation = true;  // Default enable echo cancellation
        }
    }
    
    ESP_LOGI(TAG, "Parsed TTS session: %s, %dms, %d chunks, %dHz %dch %dbit", 
            session->session_id, session->estimated_duration_ms, session->total_chunks_expected,
            session->sample_rate, session->channels, session->bits_per_sample);
    
    return ESP_OK;
}

// Parse TTS audio chunk message
static esp_err_t parse_tts_audio_chunk(const cJSON *json, vad_feedback_tts_chunk_t *chunk)
{
    if (!json || !chunk) {
        return ESP_ERR_INVALID_ARG;
    }
    
    memset(chunk, 0, sizeof(vad_feedback_tts_chunk_t));
    
    // Parse chunk info
    cJSON *chunk_info = cJSON_GetObjectItem(json, "chunk_info");
    if (!chunk_info) {
        ESP_LOGE(TAG, "Missing chunk_info in TTS audio chunk");
        return ESP_FAIL;
    }
    
    cJSON *session_id = cJSON_GetObjectItem(chunk_info, "session_id");
    if (cJSON_IsString(session_id)) {
        strncpy(chunk->session_id, cJSON_GetStringValue(session_id), sizeof(chunk->session_id) - 1);
    } else {
        ESP_LOGE(TAG, "Missing session_id in TTS audio chunk");
        return ESP_FAIL;
    }
    
    cJSON *chunk_sequence = cJSON_GetObjectItem(chunk_info, "chunk_sequence");
    if (cJSON_IsNumber(chunk_sequence)) {
        chunk->chunk_sequence = (uint16_t)cJSON_GetNumberValue(chunk_sequence);
    }
    
    cJSON *chunk_size = cJSON_GetObjectItem(chunk_info, "chunk_size");
    if (cJSON_IsNumber(chunk_size)) {
        chunk->chunk_size = (uint16_t)cJSON_GetNumberValue(chunk_size);
    } else {
        ESP_LOGE(TAG, "Missing chunk_size in TTS audio chunk");
        return ESP_FAIL;
    }
    
    cJSON *is_final = cJSON_GetObjectItem(chunk_info, "is_final");
    if (cJSON_IsBool(is_final)) {
        chunk->is_final = cJSON_IsTrue(is_final);
    }
    
    cJSON *checksum = cJSON_GetObjectItem(chunk_info, "checksum");
    if (cJSON_IsString(checksum)) {
        // Convert hex string to uint32_t
        chunk->checksum = (uint32_t)strtoul(cJSON_GetStringValue(checksum), NULL, 16);
    }
    
    // Parse timing info
    cJSON *timing = cJSON_GetObjectItem(json, "timing");
    if (timing) {
        cJSON *chunk_start_time = cJSON_GetObjectItem(timing, "chunk_start_time_ms");
        if (cJSON_IsNumber(chunk_start_time)) {
            chunk->chunk_start_time_ms = (uint16_t)cJSON_GetNumberValue(chunk_start_time);
        }
        
        cJSON *chunk_duration = cJSON_GetObjectItem(timing, "chunk_duration_ms");
        if (cJSON_IsNumber(chunk_duration)) {
            chunk->chunk_duration_ms = (uint16_t)cJSON_GetNumberValue(chunk_duration);
        }
    }
    
    // Performance optimized base64 audio data decoding
    cJSON *audio_data = cJSON_GetObjectItem(chunk_info, "audio_data");
    if (cJSON_IsString(audio_data)) {
        const char *base64_data = cJSON_GetStringValue(audio_data);
        size_t audio_len;
        uint8_t pool_index;
        
        uint64_t decode_start = esp_timer_get_time();
        esp_err_t ret = decode_base64_audio_optimized(base64_data, &chunk->audio_data, &audio_len, &pool_index);
        uint64_t decode_total = esp_timer_get_time() - decode_start;
        
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to decode base64 audio data (%.1fμs)", (float)decode_total);
            return ret;
        }
        
        // Store pool index for cleanup
        chunk->pool_index = pool_index;
        
        // Verify chunk size matches decoded data
        if (audio_len != chunk->chunk_size) {
            ESP_LOGW(TAG, "Chunk size mismatch: expected %d, got %zu (%.1fμs)", 
                    chunk->chunk_size, audio_len, (float)decode_total);
            chunk->chunk_size = audio_len;
        }
        
