Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
        ESP_LOGV(TAG, "🎵 TTS chunk decoded: %zu bytes in %.1fμs (pool: %s)", 
                audio_len, (float)decode_total, pool_index != 0xFF ? "yes" : "no");
    } else {
        ESP_LOGE(TAG, "Missing audio_data in TTS audio chunk");
        return ESP_FAIL;
    }
    
    ESP_LOGV(TAG, "Parsed TTS chunk: %s seq=%d size=%d final=%s", 
            chunk->session_id, chunk->chunk_sequence, chunk->chunk_size, 
            chunk->is_final ? "true" : "false");
    
    return ESP_OK;
}

// Parse TTS audio end message
static esp_err_t parse_tts_audio_end(const cJSON *json, vad_feedback_tts_end_t *end_info)
{
    if (!json || !end_info) {
        return ESP_ERR_INVALID_ARG;
    }
    
    memset(end_info, 0, sizeof(vad_feedback_tts_end_t));
    
    // Parse session summary
    cJSON *session_summary = cJSON_GetObjectItem(json, "session_summary");
    if (!session_summary) {
        ESP_LOGE(TAG, "Missing session_summary in TTS audio end");
        return ESP_FAIL;
    }
    
    cJSON *session_id = cJSON_GetObjectItem(session_summary, "session_id");
    if (cJSON_IsString(session_id)) {
        strncpy(end_info->session_id, cJSON_GetStringValue(session_id), sizeof(end_info->session_id) - 1);
    } else {
        ESP_LOGE(TAG, "Missing session_id in TTS audio end");
        return ESP_FAIL;
    }
    
    cJSON *total_chunks_sent = cJSON_GetObjectItem(session_summary, "total_chunks_sent");
    if (cJSON_IsNumber(total_chunks_sent)) {
        end_info->total_chunks_sent = (uint16_t)cJSON_GetNumberValue(total_chunks_sent);
    }
    
    cJSON *total_audio_bytes = cJSON_GetObjectItem(session_summary, "total_audio_bytes");
    if (cJSON_IsNumber(total_audio_bytes)) {
        end_info->total_audio_bytes = (uint32_t)cJSON_GetNumberValue(total_audio_bytes);
    }
    
    cJSON *actual_duration_ms = cJSON_GetObjectItem(session_summary, "actual_duration_ms");
    if (cJSON_IsNumber(actual_duration_ms)) {
        end_info->actual_duration_ms = (uint16_t)cJSON_GetNumberValue(actual_duration_ms);
    }
    
    cJSON *transmission_time_ms = cJSON_GetObjectItem(session_summary, "transmission_time_ms");
    if (cJSON_IsNumber(transmission_time_ms)) {
        end_info->transmission_time_ms = (uint16_t)cJSON_GetNumberValue(transmission_time_ms);
    }
    
    // Parse playback actions
    cJSON *playback_actions = cJSON_GetObjectItem(json, "playback_actions");
    if (playback_actions) {
        cJSON *fade_out_ms = cJSON_GetObjectItem(playback_actions, "fade_out_ms");
        if (cJSON_IsNumber(fade_out_ms)) {
            end_info->fade_out_ms = (uint16_t)cJSON_GetNumberValue(fade_out_ms);
        }
        
        cJSON *return_to_listening = cJSON_GetObjectItem(playback_actions, "return_to_listening");
        if (cJSON_IsBool(return_to_listening)) {
            end_info->return_to_listening = cJSON_IsTrue(return_to_listening);
        } else {
            end_info->return_to_listening = true;  // Default return to listening
        }
        
        cJSON *cooldown_period_ms = cJSON_GetObjectItem(playback_actions, "cooldown_period_ms");
        if (cJSON_IsNumber(cooldown_period_ms)) {
            end_info->cooldown_period_ms = (uint16_t)cJSON_GetNumberValue(cooldown_period_ms);
        }
    }
    
    ESP_LOGI(TAG, "Parsed TTS end: %s, %d chunks, %d bytes, %dms duration", 
            end_info->session_id, end_info->total_chunks_sent, 
            end_info->total_audio_bytes, end_info->actual_duration_ms);
    
    return ESP_OK;
}

// Performance optimized base64 decoding with pre-allocated buffers
static esp_err_t decode_base64_audio_optimized(const char *base64_data, uint8_t **audio_data, size_t *audio_len, uint8_t *pool_index)
{
    if (!base64_data || !audio_data || !audio_len) {
        return ESP_ERR_INVALID_ARG;
    }
    
    size_t base64_len = strlen(base64_data);
    if (base64_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    
    // Calculate maximum decoded length (base64 expands by ~33%)
    size_t max_decoded_len = (base64_len * 3) / 4;
    
    // Try to use pre-allocated pool buffer first for zero-malloc decoding
    uint8_t *decoded_buffer = NULL;
    uint8_t selected_pool_index = 0xFF;
    
    if (max_decoded_len <= MAX_TTS_CHUNK_SIZE) {
        // Find available pool buffer
        for (uint8_t i = 0; i < TTS_AUDIO_CHUNK_POOL_SIZE; i++) {
            if (!s_tts_chunk_pool[i].in_use) {
                s_tts_chunk_pool[i].in_use = true;
                decoded_buffer = s_tts_chunk_pool[i].buffer;
                selected_pool_index = i;
                break;
            }
        }
    }
    
    // Fallback to malloc if pool is exhausted or chunk too large
    if (!decoded_buffer) {
        decoded_buffer = malloc(max_decoded_len);
        if (!decoded_buffer) {
            ESP_LOGE(TAG, "Failed to allocate buffer for decoded audio (%zu bytes)", max_decoded_len);
            return ESP_ERR_NO_MEM;
        }
        ESP_LOGW(TAG, "Using malloc for TTS chunk (pool exhausted or large chunk: %zu bytes)", max_decoded_len);
    }
    
    // High-performance base64 decoding with mbedtls
    size_t decoded_len = 0;
    uint64_t decode_start = esp_timer_get_time();
    int ret = mbedtls_base64_decode(decoded_buffer, max_decoded_len, &decoded_len,
                                    (const unsigned char*)base64_data, base64_len);
    uint64_t decode_time = esp_timer_get_time() - decode_start;
    
    if (ret != 0) {
        ESP_LOGE(TAG, "Base64 decode failed: %d (%.1fμs)", ret, (float)decode_time);
        if (selected_pool_index != 0xFF) {
            s_tts_chunk_pool[selected_pool_index].in_use = false;
        } else {
            free(decoded_buffer);
        }
        return ESP_ERR_INVALID_ARG;
    }
    
    if (decoded_len == 0) {
        ESP_LOGW(TAG, "Base64 decode resulted in zero bytes (%.1fμs)", (float)decode_time);
        if (selected_pool_index != 0xFF) {
            s_tts_chunk_pool[selected_pool_index].in_use = false;
        } else {
            free(decoded_buffer);
        }
        return ESP_ERR_INVALID_ARG;
    }
    
    *audio_data = decoded_buffer;
    *audio_len = decoded_len;
    if (pool_index) *pool_index = selected_pool_index;
    
