Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
    ESP_LOGV(TAG, "🚀 Decoded %zu bytes in %.1fμs (pool: %s)", decoded_len, 
            (float)decode_time, selected_pool_index != 0xFF ? "yes" : "no");
    return ESP_OK;
}

// Legacy wrapper for compatibility
static esp_err_t decode_base64_audio(const char *base64_data, uint8_t **audio_data, size_t *audio_len)
{
    return decode_base64_audio_optimized(base64_data, audio_data, audio_len, NULL);
}

// Queue TTS audio item
static esp_err_t queue_tts_audio_item(vad_feedback_client_t *client, const tts_audio_queue_item_t *item)
{
    if (!client || !item) {
        return ESP_ERR_INVALID_ARG;
    }
    
    if (xQueueSend(client->tts_audio_queue, item, pdMS_TO_TICKS(100)) != pdTRUE) {
        ESP_LOGW(TAG, "Failed to queue TTS audio item - queue full");
        
        // Free audio data if this was a chunk item
        if (!item->session_start && !item->session_end && item->chunk_data.audio_data) {
            free((void*)item->chunk_data.audio_data);
        }
        
        return ESP_ERR_TIMEOUT;
    }
    
    return ESP_OK;
}

// Cleanup TTS session
static void cleanup_tts_session(vad_feedback_client_t *client)
{
    if (!client) {
        return;
    }
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        client->tts_session_active = false;
        memset(&client->current_tts_session, 0, sizeof(client->current_tts_session));
        client->tts_chunks_received = 0;
        client->tts_chunks_played = 0;
        xSemaphoreGive(client->mutex);
    }
    
    ESP_LOGI(TAG, "TTS session cleaned up");
}

// Public TTS API functions
esp_err_t vad_feedback_set_tts_audio_callback(vad_feedback_handle_t handle,
                                             vad_feedback_tts_audio_callback_t callback,
                                             void *user_data)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        client->tts_callback = callback;
        client->tts_callback_user_data = user_data;
        xSemaphoreGive(client->mutex);
        
        ESP_LOGI(TAG, "TTS audio callback %s", callback ? "registered" : "unregistered");
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t vad_feedback_handle_tts_audio_start(vad_feedback_handle_t handle,
                                             const vad_feedback_tts_session_t *session_info)
{
    if (!handle || !session_info) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->connected) {
        ESP_LOGW(TAG, "Cannot handle TTS audio start - not connected");
        return ESP_ERR_INVALID_STATE;
    }
    
    tts_audio_queue_item_t item = {
        .session_start = true,
        .session_end = false,
        .session_info = *session_info
    };
    
    return queue_tts_audio_item(client, &item);
}

esp_err_t vad_feedback_handle_tts_audio_chunk(vad_feedback_handle_t handle,
                                             const vad_feedback_tts_chunk_t *chunk_data)
{
    if (!handle || !chunk_data) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->tts_session_active) {
        ESP_LOGW(TAG, "Cannot handle TTS audio chunk - no active session");
        return ESP_ERR_INVALID_STATE;
    }
    
    // Copy chunk data to avoid lifetime issues
    vad_feedback_tts_chunk_t chunk_copy = *chunk_data;
    
    // Allocate and copy audio data
    if (chunk_data->audio_data && chunk_data->chunk_size > 0) {
        chunk_copy.audio_data = malloc(chunk_data->chunk_size);
        if (!chunk_copy.audio_data) {
            ESP_LOGE(TAG, "Failed to allocate memory for TTS audio chunk");
            return ESP_ERR_NO_MEM;
        }
        memcpy(chunk_copy.audio_data, chunk_data->audio_data, chunk_data->chunk_size);
    }
    
    tts_audio_queue_item_t item = {
        .session_start = false,
        .session_end = false,
        .chunk_data = chunk_copy
    };
    
    return queue_tts_audio_item(client, &item);
}

esp_err_t vad_feedback_handle_tts_audio_end(vad_feedback_handle_t handle,
                                           const vad_feedback_tts_end_t *end_info)
{
    if (!handle || !end_info) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->tts_session_active) {
        ESP_LOGW(TAG, "Cannot handle TTS audio end - no active session");
        return ESP_ERR_INVALID_STATE;
    }
    
    tts_audio_queue_item_t item = {
        .session_start = false,
        .session_end = true,
        .end_info = *end_info
    };
    
    return queue_tts_audio_item(client, &item);
}

esp_err_t vad_feedback_send_tts_playback_status(vad_feedback_handle_t handle,
                                               const vad_feedback_tts_status_t *status_info)
{
    if (!handle || !status_info) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (!client->connected) {
        return ESP_ERR_INVALID_STATE;
    }
    
    uint64_t timestamp = esp_timer_get_time() / 1000;
    
    // Build JSON playback status message
    char json_buffer[1024];
    int json_len = snprintf(json_buffer, sizeof(json_buffer),
        "{"
        "\"message_type\":\"tts_playback_status\","
        "\"timestamp\":%llu,"
        "\"device_id\":\"%s\","
        "\"status_info\":{"
            "\"session_id\":\"%s\","
            "\"playback_state\":%d,"
            "\"chunks_received\":%d,"
            "\"chunks_played\":%d,"
            "\"buffer_level_ms\":%d,"
            "\"audio_quality\":%d"
        "},"
        "\"performance\":{"
            "\"playback_latency_ms\":%d,"
            "\"buffer_underruns\":%d,"
            "\"audio_dropouts\":%d,"
            "\"echo_suppression_db\":%.1f"
        "}"
        "}",
        timestamp,
        client->config.device_id,
        status_info->session_id,
        status_info->playback_state,
        status_info->chunks_received,
        status_info->chunks_played,
        status_info->buffer_level_ms,
        status_info->audio_quality,
        status_info->playback_latency_ms,
        status_info->buffer_underruns,
        status_info->audio_dropouts,
        status_info->echo_suppression_db
    );
    
