Jmi2020/HowdyScreen/components/websocket_client/src/esp32_p4_vad_feedback.c
    if (json_len < 0 || json_len >= sizeof(json_buffer)) {
        ESP_LOGE(TAG, "Failed to format TTS playback status JSON message");
        return ESP_FAIL;
    }
    
    esp_err_t ret = queue_json_message(client, json_buffer);
    if (ret == ESP_OK) {
        client->stats.messages_sent++;
        client->stats.bytes_transmitted += json_len;
        ESP_LOGD(TAG, "Sent TTS playback status for session: %s", status_info->session_id);
    }
    
    return ret;
}

esp_err_t vad_feedback_get_tts_session_info(vad_feedback_handle_t handle,
                                           const char *session_id,
                                           vad_feedback_tts_session_t *session_info)
{
    if (!handle || !session_id || !session_info) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        if (client->tts_session_active && 
            strcmp(client->current_tts_session.session_id, session_id) == 0) {
            *session_info = client->current_tts_session;
            xSemaphoreGive(client->mutex);
            return ESP_OK;
        }
        xSemaphoreGive(client->mutex);
    }
    
    return ESP_ERR_NOT_FOUND;
}

esp_err_t vad_feedback_cancel_tts_session(vad_feedback_handle_t handle,
                                         const char *session_id)
{
    if (!handle || !session_id) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        if (client->tts_session_active && 
            strcmp(client->current_tts_session.session_id, session_id) == 0) {
            
            ESP_LOGI(TAG, "Cancelling TTS session: %s", session_id);
            cleanup_tts_session(client);
            
            // Clear any pending TTS audio items from the queue
            tts_audio_queue_item_t item;
            while (xQueueReceive(client->tts_audio_queue, &item, 0) == pdTRUE) {
                if (!item.session_start && !item.session_end && item.chunk_data.audio_data) {
                    free((void*)item.chunk_data.audio_data);
                }
            }
            
            xSemaphoreGive(client->mutex);
            return ESP_OK;
        }
        xSemaphoreGive(client->mutex);
    }
    
    return ESP_ERR_NOT_FOUND;
}

// Additional helper functions for TTS audio management
bool vad_feedback_is_tts_session_active(vad_feedback_handle_t handle)
{
    if (!handle) {
        return false;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    return client->tts_session_active;
}

esp_err_t vad_feedback_get_tts_stats(vad_feedback_handle_t handle,
                                     uint16_t *chunks_received,
                                     uint16_t *chunks_played)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    vad_feedback_client_t *client = (vad_feedback_client_t*)handle;
    
    if (xSemaphoreTake(client->mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        if (chunks_received) {
            *chunks_received = client->tts_chunks_received;
        }
        if (chunks_played) {
            *chunks_played = client->tts_chunks_played;
        }
        xSemaphoreGive(client->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}